# RebarShapeConstraintFixedSegmentDir Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraintFixedSegmentDir Class
Members See Also
---
A constraint that can be applied to a RebarShapeSegment and fixes the direction of the segment in UV-space.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class RebarShapeConstraintFixedSegmentDir : RebarShapeConstraint
```

Visual Basic
---
```text
Public Class RebarShapeConstraintFixedSegmentDir _
	Inherits RebarShapeConstraint
```

Visual C++
---
```text
public ref class RebarShapeConstraintFixedSegmentDir : public RebarShapeConstraint
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarShapeConstraint Autodesk.Revit.DB.Structure..::..RebarShapeConstraintFixedSegmentDir
# See Also
RebarShapeConstraintFixedSegmentDir Members
Autodesk.Revit.DB.Structure Namespace